#+TITLE: Exemple d'exercices
#+AUTHOR: Bernard Hugueney
#+DATE: <2020-09-04 Fri 16:26>
#+LANGUAGE:  fr

** Code à écrire pour charger les données
#+BEGIN_SRC ipython 
#%load hints/fr/stats/regression_to_the_mean_1.py
# Écrire le code ici
#+END_SRC

#+BEGIN_SRC ipython :mkdirp yes :exports none :tangle ./hints/fr/stats/regression_to_the_mean_1.py
#%load solutions/fr/stats/regression_to_the_mean_1.py
import pandas as pd
df_galton= pd.read_csv(# à compléter !
    )
#+END_SRC

#+BEGIN_SRC ipython :mkdirp yes :exports none :tangle ./solutions/fr/stats/regression_to_the_mean_1.py
import pandas as pd
df_galton= pd.read_csv("./Data/Heights/Galton.txt", sep='\t')
#+END_SRC

#+RESULTS:
:results:
# Out [1]: 
:end:


** Code à écrire pour calculer le coefficient de corrélation

#+BEGIN_SRC ipython
#%load hints/fr/stats/regression_to_the_mean_2.py
# Calculer le coefficient
#+END_SRC

#+BEGIN_SRC ipython :mkdirp yes :exports none :tangle ./hints/fr/stats/regression_to_the_mean_2.py
#%load solutions/fr/stats/regression_to_the_mean_2.py
girls=df_galton.loc[df_galton['Gender']=='F']
girls
#+END_SRC

#+RESULTS:
:results:
# Out [8]: 
:     Family  Father  Mother Gender  Height  Kids
: 1        1    78.5    67.0      F    69.2     4
: 2        1    78.5    67.0      F    69.0     4
: 3        1    78.5    67.0      F    69.0     4
: 6        2    75.5    66.5      F    65.5     4
: 7        2    75.5    66.5      F    65.5     4
: ..     ...     ...     ...    ...     ...   ...
: 887    203    62.0    66.0      F    61.0     3
: 889    204    62.5    63.0      F    57.0     2
: 895   136A    68.5    65.0      F    64.0     8
: 896   136A    68.5    65.0      F    63.5     8
: 897   136A    68.5    65.0      F    63.0     8
: 
: [433 rows x 6 columns]

[[file:/tmp/ob-ipython-htmlwzIzKd.html]]
:end:

#+BEGIN_SRC ipython :mkdirp yes :exports none :tangle ./solutions/fr/stats/regression_to_the_mean_2.py
#TODO
#+END_SRC


